We seem to already have tag admin rights on the service account

Adding a value to the temporary environment org level tag
https://registry.terraform.io/providers/hashicorp/google/latest/docs/resources/tags_tag_value



```
Step #3 - "tf plan": Terraform will perform the following actions:
Step #3 - "tf plan": 
Step #3 - "tf plan":   # module.google_tags_tag_key.google_tags_tag_key.key will be created
Step #3 - "tf plan":   + resource "google_tags_tag_key" "key" {
Step #3 - "tf plan":       + create_time     = (known after apply)
Step #3 - "tf plan":       + description     = "custom tag description"
Step #3 - "tf plan":       + id              = (known after apply)
Step #3 - "tf plan":       + name            = (known after apply)
Step #3 - "tf plan":       + namespaced_name = (known after apply)
Step #3 - "tf plan":       + parent          = "organizations/131880894992"
Step #3 - "tf plan":       + short_name      = "environment"
Step #3 - "tf plan":       + update_time     = (known after apply)
Step #3 - "tf plan":     }
Step #3 - "tf plan": 
Step #3 - "tf plan":   # module.google_tags_tag_key.google_tags_tag_value.value will be created
Step #3 - "tf plan":   + resource "google_tags_tag_value" "value" {
Step #3 - "tf plan":       + create_time     = (known after apply)
Step #3 - "tf plan":       + description     = "tag value description"
Step #3 - "tf plan":       + id              = (known after apply)
Step #3 - "tf plan":       + name            = (known after apply)
Step #3 - "tf plan":       + namespaced_name = (known after apply)
Step #3 - "tf plan":       + parent          = (known after apply)
Step #3 - "tf plan":       + short_name      = "prod"
Step #3 - "tf plan":       + update_time     = (known after apply)
Step #3 - "tf plan":     }

Step #4 - "tf apply": Apply complete! Resources: 2 added, 1 changed, 0 destroyed.

```
```
prod main.tf
module "google_tags_tag_key" {
  source   = "../../modules/25-tags"
  organization = local.organization_config.org_id
  depends_on = [
    data.terraform_remote_state.common,
    module.net-host-prj,
    module.firewall
  ]  
}
/*
module "google_tags_tag_value" {
  source   = "../../modules/25-tags"
  organization = local.organization_config.org_id # unused
  depends_on = [
    data.terraform_remote_state.common,
    module.net-host-prj,
    module.firewall
  ]  
}*/

25-tags
# https://registry.terraform.io/providers/hashicorp/google/latest/docs/resources/tags_tag_key
resource "google_tags_tag_key" "key" {
  #parent = var.organization#"organizations/131880894992"
  parent = "organizations/131880894992"
  short_name = "environment"
  description = "custom tag description"
}

# value
# https://registry.terraform.io/providers/hashicorp/google/latest/docs/resources/tags_tag_value

resource "google_tags_tag_value" "value" {
    parent = "tagKeys/${google_tags_tag_key.key.name}"
    short_name = "prod"
    description = "tag value description"
}

output "id" {
  value       = google_tags_tag_key.key.id
  description = "tag key id"
}

output "name" {
  value       = google_tags_tag_key.key.name
  description = "tag key name"
}



variable "organization" {
  type        = string
  description = "organization id"
}


```
<img width="1474" alt="Screenshot 2023-11-29 at 12 16 22" src="https://github.com/GoogleCloudPlatform/pbmm-on-gcp-onboarding/assets/24765473/8f4166b6-3df6-4a63-8197-fe0597b44375">
